#EVEN NUMBER AND ODD NUMBER CHECKER



print("""
┌───────────────────────────────────────────────┐
│        🔍 EVEN or ODD CHECKER 🔍             │
├───────────────────────────────────────────────┤
│   Created by : Aayush Singh 💻               │
│   From       : Nepal 🇳🇵                      │
└───────────────────────────────────────────────┘

""")
print("Write any number (EVEN AND ODD) checker")
num=int(input("Enter number :  "))

if (num % 2 == 0):
    print(num ,": is an Even number")
else:
    print(num ,": is an Odd number") 
